---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.ContainsKey(Autodesk.Revit.DB.ExportLinetypeKey)
source: html/ff5e52b2-b09c-c15d-edbd-988b3f41a6f8.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.ContainsKey Method

Checks whether a pattern key exists in the table.

## Syntax (C#)
```csharp
public bool ContainsKey(
	ExportLinetypeKey exportLinetypeKey
)
```

## Parameters
- **exportLinetypeKey** (`Autodesk.Revit.DB.ExportLinetypeKey`) - The export line type key.

## Returns
True if the line type exists in the table.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null